Q1. List any five functions of the pandas library with execution.

In [1]:
import pandas as pd

In [2]:
df = pd.read_csv("https://raw.githubusercontent.com/datasciencedojo/datasets/master/titanic.csv")

In [3]:
df.describe()     #provides summary of records in statstical ways

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

In [4]:
df.head() #first 5 data

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [5]:
df.tail() #last 5 data

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.00,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.00,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.45,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.00,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.75,NaN,Q

In [6]:
pd.Categorical(df['Cabin'])    # this function tells in a particular column how many uniques values contain

[NaN, 'C85', NaN, 'C123', NaN, ..., NaN, 'B42', NaN, 'C148', NaN]
Length: 891
Categories (147, object): ['A10', 'A14', 'A16', 'A19', ..., 'F38', 'F4', 'G6', 'T']

In [7]:
df['Cabin'].unique()   # this function gives unique data contain in particular column

array([nan, 'C85', 'C123', 'E46', 'G6', 'C103', 'D56', 'A6',
       'C23 C25 C27', 'B78', 'D33', 'B30', 'C52', 'B28', 'C83', 'F33',
       'F G73', 'E31', 'A5', 'D10 D12', 'D26', 'C110', 'B58 B60', 'E101',
       'F E69', 'D47', 'B86', 'F2', 'C2', 'E33', 'B19', 'A7', 'C49', 'F4',
       'A32', 'B4', 'B80', 'A31', 'D36', 'D15', 'C93', 'C78', 'D35',
       'C87', 'B77', 'E67', 'B94', 'C125', 'C99', 'C118', 'D7', 'A19',
       'B49', 'D', 'C22 C26', 'C106', 'C65', 'E36', 'C54',
       'B57 B59 B63 B66', 'C7', 'E34', 'C32', 'B18', 'C124', 'C91', 'E40',
       'T', 'C128', 'D37', 'B35', 'E50', 'C82', 'B96 B98', 'E10', 'E44',
       'A34', 'C104', 'C111', 'C92', 'E38', 'D21', 'E12', 'E63', 'A14',
       'B37', 'C30', 'D20', 'B79', 'E25', 'D46', 'B73', 'C95', 'B38',
       'B39', 'B22', 'C86', 'C70', 'A16', 'C101', 'C68', 'A10', 'E68',
       'B41', 'A20', 'D19', 'D50', 'D9', 'A23', 'B50', 'A26', 'D48',
       'E58', 'C126', 'B71', 'B51 B53 B55', 'D49', 'B5', 'B20', 'F G63',
       'C62 C64', 'E24', 'C90', 'C45', 'E8', 'B101', 'D45', 'C46', 'D30',
       'E121', 'D11', 'E77', 'F38', 'B3', 'D6', 'B82 B84', 'D17', 'A36',
       'B102', 'B69', 'E49', 'C47', 'D28', 'E17', 'A24', 'C50', 'B42',
       'C148'], dtype=object)

Q2. Given a Pandas DataFrame df with columns 'A', 'B', and 'C', write a Python function to re-index the DataFrame with a new index that starts from 1 and increments by 2 for each row.

In [8]:
data = {
        'A': ['Alice','Bob','Claire'],
        'B' : [25,30,27],
        'C' : ['Female','Male','Femaile']
        }

In [9]:
df = pd.DataFrame(data)
df

        A   B        C
0   Alice  25   Female
1     Bob  30     Male
2  Claire  27  Femaile

In [10]:
def reindex_dataframe(dataframe):
    new_index = range(1, 2*len(dataframe), 2)
    dataframe = df.set_index(pd.Index(new_index))
    return dataframe

In [11]:
reindex_dataframe(df)

        A   B        C
1   Alice  25   Female
3     Bob  30     Male
5  Claire  27  Femaile

Q3 .You have a Pandas DataFrame df with a column named 'Values'. Write a Python function that iterates over the DataFrame and calculates the sum of the first three values in the 'Values' column. The function should print the sum to the console. For example, if the 'Values' column of df contains the values [10, 20, 30, 40, 50], your function should calculate and print the sum of the first three values, which is 60.

In [12]:
data1 = {"Values":[10,20,30,40,50]}

In [13]:
df = pd.DataFrame(data1)

In [14]:
df[['Values']]

   Values
0      10
1      20
2      30
3      40
4      50

In [15]:
print("The sum of first three values is:",sum(df['Values'][0:3]))

The sum of first three values is: 60

Q4. Given a Pandas DataFrame df with a column 'Text', write a Python function to create a new column 'Word_Count' that contains the number of words in each row of the 'Text' column.

In [16]:
data2 = {'Text' : ['Shailove' , 'Prajwal' , 'Yash Nagla']}

In [17]:
df = pd.DataFrame(data2)

In [18]:
df['Word_count'] = df["Text"].apply(lambda x : len(x.split()))

In [19]:
df

         Text  Word_count
0    Shailove           1
1     Prajwal           1
2  Yash Nagla           2

Q5. How are DataFrame.size() and DataFrame.shape() different?

In [20]:
a = {'key1':[1,2],'key2':['shailove','pwskills']}

In [21]:
df5 = pd.DataFrame(a)

Dataframe.size() --- This will return the size of a dataframe means it can simply multiply the rows into column and gives the size of the dataframe

Dataframe.shape() --- The output is return inside a tuple and it gives the dimensions of a dataframe. dimensions like rows and columns.

see below example

In [22]:
df.shape

(3, 2)

In [23]:
df.size

6

Q6. Which function of pandas do we use to read an excel file?

we use read_excel() function to read any excel file inside a pandas

syntax : pd.read_excel('file_name' or 'Excel file link')

Q7. You have a Pandas DataFrame df that contains a column named 'Email' that contains email addresses in the format 'username@domain.com'. Write a Python function that creates a new column 'Username' in df that contains only the username part of each email address.

In [24]:
data3 = { 'Email' : ["shailovesingh@gmail.com" , "Shreeyashisaha@gmail.com"]}

In [25]:
df = pd.DataFrame(data3)

In [26]:
df

                      Email
0   shailovesingh@gmail.com
1  Shreeyashisaha@gmail.com

In [27]:
data = []
for i in df ['Email']:
    a = i.split(sep = '@')
    data.append(a[0])

In [28]:
data

['shailovesingh', 'Shreeyashisaha']

In [29]:
df['username'] = data

In [30]:
df

                      Email        username
0   shailovesingh@gmail.com   shailovesingh
1  Shreeyashisaha@gmail.com  Shreeyashisaha

Q8. You have a Pandas DataFrame df with columns 'A', 'B', and 'C'. Write a Python function that selects all rows where the value in column 'A' is greater than 5 and the value in column 'B' is less than 10. The function should return a new DataFrame that contains only the selected rows.

In [31]:
data4 = {"A":[3,8,6,2,9],
         "B":[5,2,9,3,1],
        "C":[1,7,4,5,2]}

In [32]:
df = pd.DataFrame(data4)

In [33]:
df

   A  B  C
0  3  5  1
1  8  2  7
2  6  9  4
3  2  3  5
4  9  1  2

In [34]:
def select_rows(df):
    a = (df['A']>5) & (df['B']<10)
    
    df_new = df[a].copy()
    return df_new

In [35]:
df_new = select_rows(df)

In [36]:
df_new

   A  B  C
1  8  2  7
2  6  9  4
4  9  1  2

Q9. Given a Pandas DataFrame df with a column 'Values', write a Python function to calculate the mean, median, and standard deviation of the values in the 'Values' column.

In [37]:
data9 = {'Values':[1,2,3,4,5,77,98,6,7,8,9]}

In [38]:
df = pd.DataFrame(data9)

In [39]:
df

    Values
0        1
1        2
2        3
3        4
4        5
5       77
6       98
7        6
8        7
9        8
10       9

In [40]:
mean = df['Values'].mean()
print('mean is:',mean)
median = df['Values'].median()
print('median is:',median)
std_dev = df['Values'].std()
print('standard deviation is:',std_dev)

mean is: 20.0
median is: 6.0
standard deviation is: 33.79053121807942

Q10. Given a Pandas DataFrame df with a column 'Sales' and a column 'Date', write a Python function to create a new column 'MovingAverage' that contains the moving average of the sales for the past 7 days for each row in the DataFrame. The moving average should be calculated using a window of size 7 and should include the current day.

In [41]:
date = pd.date_range(start='2023-03-01',end='2023-03-10')

In [42]:
df = pd.DataFrame({"Date":date,
                    'Sales':[100,200,300,400,500,600,700,800,900,1000]})

In [43]:
df

        Date  Sales
0 2023-03-01    100
1 2023-03-02    200
2 2023-03-03    300
3 2023-03-04    400
4 2023-03-05    500
5 2023-03-06    600
6 2023-03-07    700
7 2023-03-08    800
8 2023-03-09    900
9 2023-03-10   1000

In [45]:
df['MovingAverage']= df['Sales'].rolling(window=7,min_periods=1).mean()

In [46]:
df

        Date  Sales  MovingAverage
0 2023-03-01    100          100.0
1 2023-03-02    200          150.0
2 2023-03-03    300          200.0
3 2023-03-04    400          250.0
4 2023-03-05    500          300.0
5 2023-03-06    600          350.0
6 2023-03-07    700          400.0
7 2023-03-08    800          500.0
8 2023-03-09    900          600.0
9 2023-03-10   1000          700.0

In [47]:
date =pd.date_range(start='2023-01-01',end='2023-01-05')

In [54]:
df = pd.DataFrame({'Date':date})

In [55]:
df['Weekday'] = df['Date'].dt.day_name()

In [56]:
df

        Date    Weekday
0 2023-01-01     Sunday
1 2023-01-02     Monday
2 2023-01-03    Tuesday
3 2023-01-04  Wednesday
4 2023-01-05   Thursday

Q12. Given a Pandas DataFrame df with a column 'Date' that contains timestamps, write a Python function to select all rows where the date is between '2023-01-01' and '2023-01-31'.

In [57]:
date = pd.date_range(start='2023-01-01',end= '2023-03-31')

In [58]:
df = pd.DataFrame({'Date' :date})

In [59]:
rows  = df[df['Date'].between('2023-01-01','2023-01-31')]

In [60]:
print(rows)

         Date
0  2023-01-01
1  2023-01-02
2  2023-01-03
3  2023-01-04
4  2023-01-05
5  2023-01-06
6  2023-01-07
7  2023-01-08
8  2023-01-09
9  2023-01-10
10 2023-01-11
11 2023-01-12
12 2023-01-13
13 2023-01-14
14 2023-01-15
15 2023-01-16
16 2023-01-17
17 2023-01-18
18 2023-01-19
19 2023-01-20
20 2023-01-21
21 2023-01-22
22 2023-01-23
23 2023-01-24
24 2023-01-25
25 2023-01-26
26 2023-01-27
27 2023-01-28
28 2023-01-29
29 2023-01-30
30 2023-01-31

Q13. To use the basic functions of pandas, what is the first and foremost necessary library that needs to be imported?

The basic and foremost library that needs to be imported is 'pandas' itself. Because by importing 'pandas' library we can access and use the pandas functions.